<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Using-SQL" data-toc-modified-id="Using-SQL-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Using SQL</a></span></li><li><span><a href="#Using-pandas" data-toc-modified-id="Using-pandas-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Using pandas</a></span></li></ul></div>

In [18]:
import numpy as np
import pandas as pd


df = pd.DataFrame({'first_name': ['Rose','Summer','Jane','Kim','Jack'],
                   'last_name': ['Howard','Solstice','Kim','Cruz','Rose'],
                  'customer_id': [1,2,3,4,5]})
print(df)

  first_name last_name  customer_id
0       Rose    Howard            1
1     Summer  Solstice            2
2       Jane       Kim            3
3        Kim      Cruz            4
4       Jack      Rose            5

# Using SQL

In [2]:
%load_ext sql

In [3]:
import numpy as np
import pandas as pd
import os
import yaml

with open( os.path.expanduser('~') + "/.postgres_conf.yml", 'r') as stream:
    try:
        yaml_dict = yaml.safe_load(stream)
    except yaml.YAMLError as exc:
        print(exc)

pw = yaml_dict['password']
port = yaml_dict['port']

In [4]:
%sql postgres://postgres:$pw@localhost:$port/dvdrental

'Connected: postgres@dvdrental'

In [5]:
%sql drop table df

 * postgres://postgres:***@localhost:5432/dvdrental
Done.

[]

In [6]:
%sql persist df

 * postgres://postgres:***@localhost:5432/dvdrental

'Persisted df'

In [23]:
%%sql
select a.customer_id, a.first_name, a.last_name, b.customer_id, b.first_name, b.last_name
from df as a, df as b
where a.first_name = b.last_name

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 'Rose', 'Howard', 5, 'Jack', 'Rose'),
 (4, 'Kim', 'Cruz', 3, 'Jane', 'Kim')]

In [25]:
(pd.concat( [ df,df.add_suffix('_1')], axis=1)
 .query(" first_name == last_name_1 ")
)

Empty DataFrame
Columns: [first_name, last_name, customer_id, first_name_1, last_name_1, customer_id_1]
Index: []

# Using pandas

In [15]:
df

  first_name last_name  customer_id
0       Rose    Howard            1
1     Summer  Solstice            2
2       Jane       Kim            3
3        Kim      Cruz            4
4       Jack      Rose            5

In [16]:
df.loc[df.first_name.isin(df.last_name) | df.last_name.isin(df.first_name)]

  first_name last_name  customer_id
0       Rose    Howard            1
2       Jane       Kim            3
3        Kim      Cruz            4
4       Jack      Rose            5

In [14]:
df1 = (pd.concat([ df,df.add_suffix('_1')],axis=1))
df1

  first_name last_name  customer_id first_name_1 last_name_1  customer_id_1
0       Rose    Howard            1         Rose      Howard              1
1     Summer  Solstice            2       Summer    Solstice              2
2       Jane       Kim            3         Jane         Kim              3
3        Kim      Cruz            4          Kim        Cruz              4
4       Jack      Rose            5         Jack        Rose              5

In [10]:
df1[df1.first_name.isin(df1.last_name_1) | (df1.last_name_1.isin(df1.first_name))]

  first_name last_name  customer_id first_name_1 last_name_1  customer_id_1
0       Rose    Howard            1         Rose      Howard              1
2       Jane       Kim            3         Jane         Kim              3
3        Kim      Cruz            4          Kim        Cruz              4
4       Jack      Rose            5         Jack        Rose              5

In [26]:
print(df.merge(df, left_on='first_name', right_on='last_name'))

  first_name_x last_name_x  customer_id_x first_name_y last_name_y  \
0         Rose      Howard              1         Jack        Rose
1          Kim        Cruz              4         Jane         Kim

   customer_id_y
0              5
1              3